flat_plate_ext/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 0.1)
    (1 0 0.1)
    (1 1 0.1)
    (0 1 0.1)
    (2 0 0)
    (2 1 0)
    (2 0 0.1)
    (2 1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 1) simpleGrading (1 1 1)
    hex (1 8 9 2 5 10 11 6) (20 20 1) simpleGrading (1 1 1)
    );

edges
(
);

boundary
(
    surface_zerograd
    {
        type patch;
        faces
        (
            (1 5 4 0)
	    (3 7 6 2)
	    (2 6 11 9)
	    (9 11 10 8)
        );
    }
    bottomside
    {
        type wall;
        faces
        (
            (8 10 5 1)
        );
    }
   leftside
   {
        type patch;
        faces
		(
		 (0 4 7 3)
		);
   }
 //  rightside
 //  {
//	 type patch;
//	 faces
//	        (
//	        (2 6 5 1)
  //              );
//   }
   frontAndBack
    {
        type empty;
        faces
        (
            (5 6 7 4)
            (10 11 6 5)
	    (0 3 2 1)
	    (1 2 9 8)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
