flat_plate_ext/Allrun
blockMesh
icoFoam
touch test.foam
